# Data Structure
# Series
# Dataframe

In [1]:
import pandas as pd

In [2]:
#series bata single dimension ko data collecton garinxa
#daat frame le multiple dimesion

In [4]:
#Series
x= pd.Series([5,7,8,9,2]) # index afai dinxa series le
print(x)

0    5
1    7
2    8
3    9
4    2
dtype: int64

In [6]:
x[2]

np.int64(8)

In [7]:
x[2:4]

2    8
3    9
dtype: int64

In [8]:
x = pd.Series([5,7,8,9],index =['a','b','c','d'])
print(x)

a    5
b    7
c    8
d    9
dtype: int64

In [9]:
x['a':'c']

a    5
b    7
c    8
dtype: int64

In [10]:
#loc()

x= pd.Series([5,7,8,9,2])
print(x)

0    5
1    7
2    8
3    9
4    2
dtype: int64

In [11]:
x[1] # yehi task loc bata garne

np.int64(7)

In [12]:
# data frame ma loc nai use garne ie index nai dinxa yesle ni
x.loc[1]

np.int64(7)

In [13]:
y = pd.Series([5,7,8,9],index =['a','b','c','d'])
print(y)

a    5
b    7
c    8
d    9
dtype: int64

In [14]:
y.loc['b']# index ko kaam nai garne ho

np.int64(7)

In [ ]:
# iloc lai -implicit lock vaninxa afai index dida pani afno imlicit ie duitai index store gareko hunxa ie default 0,1 ra afule deko a, b
# aru nai index rakheko xam vaneki o, 1 index bata data access garna sakinxa
#index change gariyeko xaina vane loc ra iloc ko same op auxa
#data frame ma loc iloc use garera index bata data access garna parxa

In [15]:
y.iloc[1] # paila dfault index bata ni acess vayo

np.int64(7)

In [ ]:
# tabular data haru ko lagi data frame chahinxa

In [16]:
#dataframe
#dictionary

In [20]:


#empty bracket diyo bane dictionary banxa
#dictinary ma mutliple value xa bhaneh listbanaune

dis = {
    'roll':[4,5,6,7,12], # list banako
    'name':['sita','C','D','E','F'],
    'faculty':['DS','CS','DS','CS','DS']
    
}

In [18]:
# data frame ko lagi df banaune

In [ ]:
#roll,name ,faculty column bana janxa table ma
#auta tablema mulitple data ko lagi

In [21]:
df = pd.DataFrame(dis)
print(df)

   roll  name faculty
0     4  sita      DS
1     5     C      CS
2     6     D      DS
3     7     E      CS
4    12     F      DS

In [22]:
type(df)

pandas.core.frame.DataFrame

In [24]:
#dataframe ko function ni run garna sakinxa

df.shape

(5, 3)

In [25]:
df.columns

Index(['roll', 'name', 'faculty'], dtype='object')

In [26]:
# data lai load garxam as a dataframe

In [27]:
#csv file lai load garne as s dataframe full path dine read_csv function use garne

In [31]:
data = pd.read_csv('Salary_Data.csv') # csv file lai load gareko

In [32]:
print(data)

      Age  Gender Education Level                      Job Title  \
0    32.0    Male      Bachelor's              Software Engineer
1    28.0  Female        Master's                   Data Analyst
2    45.0    Male             PhD                 Senior Manager
3    36.0  Female      Bachelor's                Sales Associate
4    52.0    Male        Master's                       Director
..    ...     ...             ...                            ...
370  35.0  Female      Bachelor's       Senior Marketing Analyst
371  43.0    Male        Master's         Director of Operations
372  29.0  Female      Bachelor's         Junior Project Manager
373  34.0    Male      Bachelor's  Senior Operations Coordinator
374  44.0  Female             PhD        Senior Business Analyst

     Years of Experience    Salary
0                    5.0   90000.0
1                    3.0   65000.0
2                   15.0  150000.0
3                    7.0   60000.0
4                   20.0  200000.0
..                   ...       ...
370                  8.0   85000.0
371                 19.0  170000.0
372                  2.0   40000.0
373                  7.0   90000.0
374                 15.0  150000.0

[375 rows x 6 columns]

In [33]:
#dataframe ko attributes ra function haru herxam
#dataframes - attributes, functions . garera call garnu parxa ra attribute lai . garne function lai .() garen

In [ ]:
# functions in dataframe
.head()
.tail()
.sample()
.describe
.info()
#attributes
.shape
.columns

In [34]:
data.head() # top 5 rows is data dinxa # by default 5 ota dinxa

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [35]:
data.head(10) # afaile dina pani milyo

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0

In [36]:
data.tail() # last ko 5 pta data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [37]:
data.tail(10)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
365,43.0,Male,Master's,Director of Marketing,18.0,170000.0
366,31.0,Female,Bachelor's,Junior Financial Analyst,3.0,50000.0
367,41.0,Male,Bachelor's,Senior Product Manager,14.0,150000.0
368,44.0,Female,PhD,Senior Data Engineer,16.0,160000.0
369,33.0,Male,Bachelor's,Junior Business Analyst,4.0,60000.0
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [38]:
data.sample(10)# sample le randomly data dinxa ie jigjag data dinxa  ra value nai dina parxa yesma chai

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
40,34.0,Female,Master's,UX Designer,5.0,80000.0
43,36.0,Female,Bachelor's,Administrative Assistant,8.0,45000.0
70,33.0,Male,Bachelor's,Web Developer,6.0,65000.0
77,32.0,Male,Master's,Senior Software Engineer,6.0,100000.0
120,42.0,Female,Bachelor's,Sales Manager,17.0,100000.0
217,50.0,Female,PhD,Director of Operations,22.0,180000.0
246,49.0,Female,Master's,Director of Marketing,21.0,180000.0
262,46.0,Male,PhD,Senior Data Scientist,18.0,160000.0
192,30.0,Female,Bachelor's,Junior Social Media Manager,3.0,45000.0
320,45.0,Female,Master's,Senior Marketing Manager,16.0,160000.0

In [39]:
data.shape # shape attribute ho so bracket dina parena no fo rows ra column dinxa tuple ko form ma dinxa data

(375, 6)

In [41]:
data.shape[1]# index matra pani dina milxa index ma 0 diyo vane rows matra dinxa

6

In [43]:
print(data.columns) # columns haru matra dnxa

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [44]:
#select particular rows or columns

In [45]:
#for columsn columns name bata display garna sakinxa
#syntax: Dataframe.column_name(new syntax)
data.Age # age column matra diyo . data wala ko column ma space xa bhane kaam gardaina yesle

0      32.0
1      28.0
2      45.0
3      36.0
4      52.0
       ...
370    35.0
371    43.0
372    29.0
373    34.0
374    44.0
Name: Age, Length: 375, dtype: float64

In [47]:
data['Gender'] # yesari ni dina milyo column nikalna xa bhane

0        Male
1      Female
2        Male
3      Female
4        Male
        ...
370    Female
371      Male
372    Female
373      Male
374    Female
Name: Gender, Length: 375, dtype: object

In [48]:
data.Education Level # yesari diyena kinaki data ma space xa . dot le kaam garena

SyntaxError: invalid syntax (1482793246.py, line 1)

In [49]:
data['Education Level']

0      Bachelor's
1        Master's
2             PhD
3      Bachelor's
4        Master's
          ...
370    Bachelor's
371      Master's
372    Bachelor's
373    Bachelor's
374           PhD
Name: Education Level, Length: 375, dtype: object

In [ ]:
#exploratory data analysis(EDA) data ma kaam garnu vanda agadi data lai explore garxan ie EDA

In [50]:
#for rows 0th index ma vako data acces garna xa vane

data.loc[0]

Age                                 32.0
Gender                              Male
Education Level               Bachelor's
Job Title              Software Engineer
Years of Experience                  5.0
Salary                           90000.0
Name: 0, dtype: object

In [51]:
data.loc[0:5] # 0 ra 5 index duitai auxa

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0

In [52]:
data.iloc[0:5] #0 to 4 matra access vahyo ie exclusive

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [ ]:

# single column garda series banayera deko xa ie series bhaneko single column
# duita column access hudaina data['Age','Gender'] yesari series le kaam gardaina
#auta column banda badi column access garna x bhane as data frame access garne parxa

In [53]:
data[['Age','Gender']] # syntax: data[[]] # duitai bracket ho sabaai ma

      Age  Gender
0    32.0    Male
1    28.0  Female
2    45.0    Male
3    36.0  Female
4    52.0    Male
..    ...     ...
370  35.0  Female
371  43.0    Male
372  29.0  Female
373  34.0    Male
374  44.0  Female

[375 rows x 2 columns]

In [54]:
data[['Age','Gender','Job Title']] # data frame ma column chaheko xa bhane [[]]duita column le access garne

      Age  Gender                      Job Title
0    32.0    Male              Software Engineer
1    28.0  Female                   Data Analyst
2    45.0    Male                 Senior Manager
3    36.0  Female                Sales Associate
4    52.0    Male                       Director
..    ...     ...                            ...
370  35.0  Female       Senior Marketing Analyst
371  43.0    Male         Director of Operations
372  29.0  Female         Junior Project Manager
373  34.0    Male  Senior Operations Coordinator
374  44.0  Female        Senior Business Analyst

[375 rows x 3 columns]

In [55]:
data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [ ]:
#data ko type xuttauxau afai
# Numerical ie continuous ie integer ,float
Numerical(int,float) #float bhane bittikai integrer ra float ma xa data
Categrorical(object) # object bhane bittikai categorical

In [56]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               373 non-null    object
 2   Education Level      373 non-null    object
 3   Job Title            373 non-null    object
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 17.7+ KB

In [57]:
data.describe() # 25% q1,.. yesari data ko

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [ ]:
# age 21 dekhi 62 sama xa mean(33), median(32) ie most of the age chai 21 tira xa

In [ ]:
#titanic.csv data set ma kaam garxam hmaai